{
  "title": "2024 Global Game Jam",
  "date": "2024/01/26 - 2024/01/28",
  "topic": "Make Me Laugh",
  "sections": [
    {
      "heading": "序言"
    },
    {
      "content": "2024GGJ是我参加的第一场线下Game Jam。和同伴们在48小时的有限时间内创作一款游戏，在当时看来是一个非常有趣的挑战、十分新奇的体验。"
    },
    {
      "content": "第一次参加Game Jam，就只能找没有合作过的同伴了。我在我能联系的有相关兴趣的朋友中问了一圈，最终组成了由我带头的1程序3美术的队伍：我、补白、明明子和汤圆。我希望最好能通过Game Jam产出一些作品，也当作是我的“来时路”。我想我们大多数人也是把GGJ当作一次活动，而非比赛。活动嘛，尽兴就好。"
    },
    {
      "content": "于是，我们在2024年的这天，来到了深圳凉屋游戏的公司场地。我们的1位队友——汤圆——在伦敦跨时区和我们一起创作。尽管没有经验，最终导致我们的游戏并不完善。但这次体验令我难忘，并且也为我后续的Game Jam提供了一套流程“原则”。"
    },
    {
      "heading": "初来乍到"
    },
    {
      "content": "我们刚到现场的时候，看到大家带着各自的设备“摩拳擦掌”，不由得感到非常兴奋。我们找到了一块比较靠窗的区域，作为我们的“阵地”。随后，我们花了些时间了解环境。"
    },
    {
      "content": "很快到了开题的时间，随着凉屋的工作人员播放的视频结束，主题也展示了出来：Make Me Laugh。"
    },
    {
      "content": "其实这个主题还挺让我懵逼的，根据了解到的近几年的主题，我还以为会是一个名词性的主题。不过马上，我们就围绕主题展开了会议。"
    },
    {
      "content": "这个主题确实令我们有些难办，感觉提不出什么比较合适的想法。汤圆很快提出了，能不能设计一个忧郁的小人，玩家通过各种流程了解到小人的一天。最后，提供一个正向或反向的结局来响应主题。明明子很快也附和这个想法，说最后可以是某件事情，让主角会心一笑。"
    },
    {
      "content": "剩下的人对这个主题确实没什么好的想法，便也认同了汤圆提出的想法。然后关于玩法，大家普遍认为做点击解密类型就好。但这实际上就成了做剧情向，其实也为后续挖下了坑。"
    },
    {
      "heading": "超限超载危险"
    },
    {
      "content": "作为程序，我起初认为，不就是点击解密嘛。判断点击，根据条件响应或者是改变条件这些操作。"
    },
    {
      "content": "队伍里面又提出，既然要展示主角的一天，就要有不同情景，也就是做成多个关卡。嗯，关卡制的点击解密，做好一套系统就可以复用了。"
    },
    {
      "content": "再接着，又提出，第一关是主角刚刚睡醒，首先要快速地反复点击主角来表现主角的起床困难症。然后主角起床之后，在房间内点击不同位置移动到不同位置，洗漱、吃饭等。接着，还要在柜子内一堆杂乱的物品中寻找自己需要的东西，通过拖拽的跟随缓慢来表现主角的无力。"
    },
    {
      "content": "到这里的时候我还认为问题不大，毕竟功能本身不困难。点击移动可以用我近期写的A*来解决，其余的功能就只是点击、拖拽和状态改变。"
    },
    {
      "content": "最终，第一关要在主角完成一系列流程后，移动到门口，出门。"
    },
    {
      "content": "其实讨论到这里，我就有点坐不住了。功能虽然不难实现，但可能一时间理不清程序架构，能复用到后续关卡吗？后来发现这不是需要考虑的问题——因为紧接着登场的是第二关的玩法讨论。"
    },
    {
      "content": "第二关的玩法，直接脱离了第一关。队伍内认为，主角出门之后，可以是去商场。在商场内要面对什么呢？各种销售的“话术”。这里的玩法被设计为弹幕躲避，角色跟随玩家的鼠标移动，坚持一段时间，躲避各种“话术”。"
    },
    {
      "content": "第三关，几个队友又提出用音游来表现主角和朋友的沟通困难。"
    },
    {
      "content": "作为队伍里唯一的程序，我开始发出抗议的声音。每一关的玩法都不一样，没有办法复用程序。"
    },
    {
      "content": "最终，玩法被确定下来，如上所述。如果说Game Jam的时间限制是一辆车，那么我们队伍的玩法设计已经严重超载了。超载，是非常危险的。"
    },
    {
      "heading": "孜孜不得倦"
    },
    {
      "content": "确定了玩法之后，几位美术开始分工，而我这边则开始着手程序的实现。"
    },
    {
      "content": "我这边的开发效率也比较一般，从下午开题到第二天半夜，只完成了播放动画、快速点击起床到在房间内点击移动的功能。点击移动功能直接迁用了我在GGJ前夕写的A*寻路算法，算是比较顺利。"
    },
    {
      "content": "差不多一直干到第二天下午，第一关的功能才算是完整。主角终于能起床、洗漱、吃饭、翻找物品、出门了。"
    },
    {
      "content": "对了，迁用A*算法的时候还出现了边界值问题，应该是我原来A*的代码没写对，也是花了点时间调试。"
    },
    {
      "content": "相对于第一关的各类判断，第二关反倒让我松了一口气。做成角色跟随鼠标移动，然后对弹幕做碰撞检测就好了——反正Unity给了现成的Collider。通过Prefab和Animator做了不同类型弹幕的移动路径。"
    },
    {
      "content": "一直到第三天上午，第二关的流程才基本完成，中间还坚持不住昏了3小时。看着剩下的时间，很明显是来不及做第三关的玩法了——姑且不说音游玩法存在哪些落地难点，我本身就没有开发音游玩法的经验。"
    },
    {
      "content": "看着目前的进度，队伍里也一致同意砍掉后续流程，先保证游戏包体可以生成。"
    },
    {
      "heading": "月有阴晴圆缺"
    },
    {
      "content": "最终，赶在路演前，完成了包体的输出并给到了凉屋的工作人员。"
    },
    {
      "content": "但是当然，相对于我们一开始的设计，游戏本身是不完整的。这多少也算一点遗憾。"
    },
    {
      "content": "在路演过程中，我看到了各个队伍的创意。大家对Make Me Laugh的解读各异。也能看到不同团队做出的游戏体量不同，有的团队就是用非常简单的玩法，来阐述主题。有的团队绕一大圈，最终扣题。"
    },
    {
      "content": "有的团队根本没有使用游戏引擎，甚至没有使用适用于游戏开发的技术，比如WPF（或者也可能是WinForm）。"
    },
    {
      "content": "在GGJ中，大家的共同目标就是用自己的方式和创意去演绎主题。作为我第一次参加的线下Game Jam，虽然最终做出的作品并不完善，但确实是非常宝贵的体验。"
    },
    {
      "content": "对于这次Game Jam，我清晰地记得明明子给出了“我好久没有吃得这么爽了”的高度评价（凉屋站提供了许多员工零食）。"
    },
    {
      "content": "这次经验也让我总结了自己的流程“原则”：要有一个核心玩法，首先保证核心玩法的落地，再围绕核心玩法进行扩展。就像软件工程上会选择先产出MVP（Most Viable Product，最小可行性产品），再通过迭代模型来更新产品一样。"
    },
    {
      "content": "这篇复盘是为了丰富我这个Game Jam作品集站点的内容，是站点的第一篇复盘。距离这场Game Jam已经过去了一年半了，有些细节也记不太清了。不论怎样，它确实奠定了我后来Game Jam的“原则”。"
    },
    {
      "content": "作于2025/09/30。"
    }
  ]
}
