{
  "title": "2025 聚光灯 21 天游戏创作挑战",
  "date": "2025/10/10 - 2025/10/30",
  "topic": "你确定这不是bug吗？",
  "sections": [
    {
      "heading": "报名期"
    },
    {
      "content": "今年因为做了手术，身体原因没有参加CGJ，以及觉得这一年来没做什么作品，所以当注意到TapTap今年再度举办聚光灯GameJam时，便决定报名参加。"
    },
    {
      "content": "虽然说起来不太合适，但这应该算我第3次参加21天的线上Game Jam。而前两次的合作项目都难产了，也导致我后来比较长的一段时间没有参加线上Game Jam。大家确实有各自的个性，而人与人之间总难以避免存在一些磨合上的问题。"
    },
    {
      "content": "总之，这次重拾热情参加聚光灯Game Jam，我还是希望自己一个人承担程序。毕竟，对我来说我这次更希望作品能落地，而我对自己的技术是比较有把握的。"
    },
    {
      "content": "我优先找到了我最信任的队友，有过多次线下GJ合作经验的策划，之一。同时，我也向认识许久的另一位（不愿透露身份的）策划B发出邀请，对方也欣然接受了。"
    },
    {
      "content": "在与两位策划初步达成联系后，我们发现目前好像没有人负责美术。策划B很快向我们介绍了他们去年参与CUSGA的队伍的美术，小辰子，非常有水平。以及不久之后，我又向（或许在GGJ见过但确实线下不认识的）音乐音效，苏筠，发起了组队参与本次聚光灯的邀请。对方也很快接受了。"
    },
    {
      "content": "考虑到这次两位策划，于是达成了由之一作为主策，策划B负责辅佐的共识。至此，我们队伍便初步完成组队。等待漫长的报名期过去。"
    },
    {
      "heading": "报名确认期"
    },
    {
      "content": "国庆假期后的这两天，就是报名确认期。按照主办方TapTap的通知，我们创建了游戏厂商身份，以及占位游戏详情页。"
    },
    {
      "content": "这时候让我有些担心的是，在没有成功让21天项目落地的经验下，我怎么保证自己能做好项目管理。我尝试效仿之前48小时GJ的经验，用在线白板来协作，并且先预置了一张甘特图在白板中。"
    },
    {
      "content": "不过策划B认为，这样做没有意义。到时候会发现需要调整的安排有很多——后来的开发进度也证实了这个观点。"
    },
    {
      "content": "除此之外，我还问了之一这次有什么想做的类型。之一的答复是希望参考《邪恶冥刻》的机制，做一些改动和创新。我便去找了这款游戏的实况视频以及亲自去体验。《邪恶冥刻》除了网格式卡牌玩法作为核心以外，还融合了肉鸽、解谜、献祭等特点。"
    },
    {
      "heading": "开发期"
    },
    {
      "content": "令人期待的开发期总算开始了。大家点开了聚光灯活动主页，赫然看到主题处显示着一个巨大的“BUG?”以及一行小字“你确定这不是bug吗？”。"
    },
    {
      "content": "所以主题是“BUG?”么，有些意思。"
    },
    {
      "content": "很快，我们确定了一个大家都比较方便的时间，然后开展了第一场组会。一开始大家其实都不太放得开，组会基本是由策划B组织的。"
    },
    {
      "content": "组会上策划B首先让各位队员各自做了介绍，对擅长的风格这些方面相互有了一定了解。随后，对主题解读展开了讨论。我和策划B的共识是，“BUG?”这个主题，它的重点不在于bug，而是后面的问号。也就是说，要让玩家产生一种疑惑感。具体一点的例子，比如通过知识锁的设计，让玩家发现后感到惊讶，从而改变玩家的思维惯性的玩法。"
    },
    {
      "content": "核心玩法上，还是延续了参考《邪恶冥刻》的机制做卡牌游戏的想法。在这个基础上，我们继续展开了头脑风暴。策划B拉了一张表格，给大家一些时间，把各自能想到的关键词都填了进去。在各自解释完所填的关键词后，这部分时间便交给之一设计玩法了。"
    },
    {
      "content": "很快到了第二天，之一给出了一个初版的游戏策划案。随后我们展开了第二次组会，对策划案的一些设计进行了讨论。之后大家便展开了各自的工作。策划B对游戏剧情进行了初步设计，同时开始编写需求表；我开始参照策划案编写战斗系统的框架；小辰子开始了登录界面的绘制；苏筠则等了一段时间的需求。而之一则为了求职，投身去了全国各地线下面试。"
    },
    {
      "content": "突然，主办方在通知群里表示，他们从开发日志发现，许多参赛选手错误理解了主题：主题是“你确定这不是bug吗？”，而“BUG?”图样则是一种视觉设计。这个情况在组队群里引起了激烈讨论。不过对我们来说，影响不大，解读思路是类似的。"
    },
    {
      "content": "主策的忙碌其实给我带来了一个问题，就是策划案的未尽之处，没办法很快地确认详细需求。编写代码时常常遇到要不要做解耦、分层的问题——过度架构会导致开发进展缓慢。如果缺乏合适的架构，又容易导致需要插入功能时非常棘手。"
    },
    {
      "content": "这次Game Jam的一个误点，或许就是专门做战斗系统。我以为21天的时间足够长，系统机制足够简单，所以我想做一套单独拿得出手的战斗系统架构，然而事实还是证明我的判断激进了。结果就是，我们的战斗系统是界面无关的——它可以脱离Unity的环境编译，它是一个纯粹的逻辑层，充当观察者模式的“主题”。技术角度而言这很好，同时又导致开发时间不够充分。"
    },
    {
      "content": "在战斗系统完成大体流程后，我就展开了界面层的开发——话虽如此，其实为了赶开发进度，很多脚本我直接无脑采用了GPT的输出，这又带来了一些隐患。此外，我选择了使用DOTween实现对局的过渡动画效果。"
    },
    {
      "content": "与此同时，小辰子的桌面场景的外框和背景已经绘制完成；苏筠也拿到了音效需求开始着手制作。这时候，开发期已经过去了7天。"
    },
    {
      "content": "起初我完全没意识到21天还是那么紧张，同时由于队伍内的开发进展非常模糊，让我感到不安。策划B发现了我的心不在焉，便向我发问。之后，策划B便邀请大家常态化走屏幕共享，让各位的进展更加透明化一些。同期，策划B也开始了各种卡牌的具体效果设计。"
    },
    {
      "content": "然而开发进度还是不理想，到了大概第12天的时候，与之一、策划B进行了讨论，我们开始做出了抉择：随能量变化的状态，常态、故障、过载，以及卡牌本身的状态，翻面、横置、旋转。我们选择了先做前者，因为能量机制已经和玩家、对局产生了一定关系，看起来有些眉目；但卡牌自身状态的实现尚不明朗。"
    },
    {
      "content": "也大致在这两天，小辰子完成了对局场景的素材绘制。策划B考虑到小辰子学业比较忙碌，便中途邀请了美术Ela参与进来，帮助各个卡面形象的绘画。"
    },
    {
      "content": "第15天左右时，基本的战斗流程、随能量变化的状态都大致完成了。我们终于有了一个可以打包运行的、只有完整对局的0.1.x版本包，其中实现了一部分卡牌的效果。和策划B做了一些讨论，我认为为了保证产出完整游戏流程的包体，应当放弃战斗系统的剩余部分。于是我们便开始着手剧情相关的开发。"
    },
    {
      "content": "接下来的几天，我主要投入于桌面场景的相关开发，例如剧情提示、图标交互等。不过受限于开发时间，部分功能的可维护性较低（我们的作品也不像是会持续维护的项目，策划B也认为能在这次比赛端出完整作品即可）。同时，继续实现剩余的卡牌效果，以及根据测试反馈对战斗逻辑、卡牌效果进行修正。"
    },
    {
      "content": "我们也拿到了苏筠的音效，初版的卡牌攻击音效就像激光炮一样。很有意思。Ela和小辰子也给到了桌面场景需要的各种图标和按钮。很快我们的0.2.x版本包也投入了测试。"
    },
    {
      "content": "为了提前提交包体，避免平台审核打回的风险，可以说我是卯足了劲进入了48小时GJ的不眠不休状态。像前面所说的，由于赶进度无脑使用GPT的代码，导致对代码不够熟悉，产生了一些bug——一些界面层卡槽在其中卡牌被击败后未被释放占用，导致玩家无法放牌。像这样的bug又花了一通宵的时间处理，让GPT的代码和自己的代码逻辑可以对接上。"
    },
    {
      "content": "还有像是卡牌在战斗过程中被击败，直接被销毁，导致DOTween未能完成，从而无法完成回调致使流程卡住的问题。在为大部分效果逻辑补充了潜在的null判断后，还在效果触发处添加了try-catch块，以绝后患，保障对局流程至少通畅。"
    },
    {
      "content": "终于紧赶慢赶，我们完成了一个经过测试可以完整走通游戏全流程的包体，并且在第17天晚上初次提审了。第18天半夜，我仍未休息时，版本居然被审核打回了！同时我也在继续修复一些bug，到了早上，我们重新提审了两次，才终于将带包体的版本发布到平台。"
    },
    {
      "content": "版本审核的主要难度在于物料是否符合TapTap的要求，我们被打回的两次原因，先后是竖版封面色调过暗被判为黑白封面，和实机视频在5秒内没有进入核心玩法。包体本身很好过审——至少对我们这次的作品来说是的。"
    },
    {
      "content": "当然，并不是包体上架了就万事顺遂了——我们的游戏仍然有许多可优化和修复的点。好消息是，包体上架一方面可以保证我们投稿参赛，另一方面可以在积累数据的同时让玩家反馈遇到的问题。毕竟活动进入下一阶段后就不能更新包体了。"
    },
    {
      "content": "最后的几天，我们打包了Android包体，添加了一些玩家难以意识到的机制的提示，优化了一些操作体验和视觉体验，修复了一些比较影响效果的逻辑。于是，我们将Windows版和Android版两个流程完整、没有显著bug的版本包，送入了试玩评审。"
    },
    {
      "heading": "试玩评审期"
    },
    {
      "content": "队长群可以看到有1300多号人，而TapTap最终展示在本次聚光灯GameJam主页的作品只有632款。说明今年只有不到50%的队伍完赛了，而我们就是这前50%，这已经很值得高兴了。"
    },
    {
      "content": "TBC…"
    }
  ]
}
